ukhan717/rt595-mipi/TargetSpecific/Drivers/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name FC0_RXD_SDA_MOSI_DATA (coord H16), J45[22]/U9[13]/U105[4]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITUARTPINS_DEBUG_UART_RX_PERIPHERAL FLEXCOMM0
/*!
 * @brief Signal name */
#define BOARD_INITUARTPINS_DEBUG_UART_RX_SIGNAL RXD_SDA_MOSI_DATA
/* @} */

/*! @name FC0_TXD_SCL_MISO_WS (coord G16), J45[32]/U105[3]/U9[12]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITUARTPINS_DEBUG_UART_TXD_PERIPHERAL FLEXCOMM0
/*!
 * @brief Signal name */
#define BOARD_INITUARTPINS_DEBUG_UART_TXD_SIGNAL TXD_SCL_MISO_WS
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUARTPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FULLDRIVE_EN 0x0100u   /*!<@brief Full drive enable */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_FUNC8 0x08u            /*!<@brief Selects pin function 8 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */
#define IOPCTL_PIO_SLEW_RATE_SLOW 0x80u   /*!<@brief Slow mode */

/*! @name FC4_RXD_SDA_MOSI_DATA (coord D14), J45[58]/I2C_SDA/U6[6]/ACC_I2C_SDA
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIOPANELPINS_ACC_I2C_SDA_PERIPHERAL FLEXCOMM4
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIOPANELPINS_ACC_I2C_SDA_SIGNAL RXD_SDA_MOSI_DATA
/* @} */

/*! @name FC4_TXD_SCL_MISO_WS (coord B11), J45[60]/I2C_SCL/U6[4]/ACC_I2C_SCL
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIOPANELPINS_ACC_I2C_SCL_PERIPHERAL FLEXCOMM4
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIOPANELPINS_ACC_I2C_SCL_SIGNAL TXD_SCL_MISO_WS
/* @} */

/*! @name FLEXIO_D0 (coord R8), J27[3]/J43[13]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXIOPANELPINS_FXIO_D0_PERIPHERAL FLEXIO0     /*!<@brief Peripheral name */
#define BOARD_INITFLEXIOPANELPINS_FXIO_D0_SIGNAL IO              /*!<@brief Signal name */
#define BOARD_INITFLEXIOPANELPINS_FXIO_D0_CHANNEL 0              /*!<@brief Signal channel */
                                                                 /* @} */

/*! @name FLEXIO_D1 (coord P10), J28[10]/J30[6]/J43[14]/FXIO_D1
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIOPANELPINS_D1_PERIPHERAL FLEXIO0
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIOPANELPINS_D1_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIOPANELPINS_D1_CHANNEL 1
/* @} */

/*! @name FLEXIO_D2 (coord U10), J28[9]/J30[5]/J43[15]/FXIO_D2
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXIOPANELPINS_D2_PERIPHERAL FLEXIO0
/*!
 * @brief Signal name */
#define BOARD_INITFLEXIOPANELPINS_D2_SIGNAL IO
/*!
 * @brief Signal channel */
#define BOARD_INITFLEXIOPANELPINS_D2_CHANNEL 2
/* @} */

/*! @name FLEXIO_D3 (coord T8), J27[4]/J43[16]/FXIO_D3
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXIOPANELPINS_D3_PERIPHERAL FLEXIO0             /*!<@brief Peripheral name */
#define BOARD_INITFLEXIOPANELPINS_D3_SIGNAL IO                      /*!<@brief Signal name */
#define BOARD_INITFLEXIOPANELPINS_D3_CHANNEL 3                      /*!<@brief Signal channel */
                                                                    /* @} */

