ukhan717/rt595-mipi/TargetSpecific/Drivers/pin_mux.h
/*! @name FLEXIO_D4 (coord T10), J27[5]/J43[17]/FXIO_D4
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXIOPANELPINS_D4_PERIPHERAL FLEXIO0             /*!<@brief Peripheral name */
#define BOARD_INITFLEXIOPANELPINS_D4_SIGNAL IO                      /*!<@brief Signal name */
#define BOARD_INITFLEXIOPANELPINS_D4_CHANNEL 4                      /*!<@brief Signal channel */
                                                                    /* @} */

/*! @name FLEXIO_D5 (coord T11), J27[6]/J43[18]/FXIO_D5
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXIOPANELPINS_D5_PERIPHERAL FLEXIO0             /*!<@brief Peripheral name */
#define BOARD_INITFLEXIOPANELPINS_D5_SIGNAL IO                      /*!<@brief Signal name */
#define BOARD_INITFLEXIOPANELPINS_D5_CHANNEL 5                      /*!<@brief Signal channel */
                                                                    /* @} */

/*! @name FLEXIO_D6 (coord T12), J27[7]/J43[19]/FXIO_D6
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXIOPANELPINS_D6_PERIPHERAL FLEXIO0             /*!<@brief Peripheral name */
#define BOARD_INITFLEXIOPANELPINS_D6_SIGNAL IO                      /*!<@brief Signal name */
#define BOARD_INITFLEXIOPANELPINS_D6_CHANNEL 6                      /*!<@brief Signal channel */
                                                                    /* @} */

/*! @name FLEXIO_D7 (coord P9), J27[8]/J43[20]/FXIO_D7
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXIOPANELPINS_D7_PERIPHERAL FLEXIO0             /*!<@brief Peripheral name */
#define BOARD_INITFLEXIOPANELPINS_D7_SIGNAL IO                      /*!<@brief Signal name */
#define BOARD_INITFLEXIOPANELPINS_D7_CHANNEL 7                      /*!<@brief Signal channel */
                                                                    /* @} */

/*! @name FLEXIO_D14 (coord R9), J28[5]/J43[10]/FXIO_D14
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXIOPANELPINS_WR_PERIPHERAL FLEXIO0              /*!<@brief Peripheral name */
#define BOARD_INITFLEXIOPANELPINS_WR_SIGNAL IO                       /*!<@brief Signal name */
#define BOARD_INITFLEXIOPANELPINS_WR_CHANNEL 14                      /*!<@brief Signal channel */
                                                                     /* @} */

/*! @name FLEXIO_D15 (coord R10), J28[6]/J43[11]/FXIO_D15
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXIOPANELPINS_RD_PERIPHERAL FLEXIO0              /*!<@brief Peripheral name */
#define BOARD_INITFLEXIOPANELPINS_RD_SIGNAL IO                       /*!<@brief Signal name */
#define BOARD_INITFLEXIOPANELPINS_RD_CHANNEL 15                      /*!<@brief Signal channel */
                                                                     /* @} */

/*! @name PIO5_1 (coord M9), J28[4]/J43[9]/FXIO_D13
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXIOPANELPINS_CS_PERIPHERAL GPIO                /*!<@brief Peripheral name */
#define BOARD_INITFLEXIOPANELPINS_CS_SIGNAL PIO5                    /*!<@brief Signal name */
#define BOARD_INITFLEXIOPANELPINS_CS_CHANNEL 1                      /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITFLEXIOPANELPINS_CS_GPIO GPIO                      /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITFLEXIOPANELPINS_CS_GPIO_PIN_MASK (1U << 1U)       /*!<@brief GPIO pin mask */
#define BOARD_INITFLEXIOPANELPINS_CS_PORT 5U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFLEXIOPANELPINS_CS_PIN 1U                         /*!<@brief PORT pin number */
#define BOARD_INITFLEXIOPANELPINS_CS_PIN_MASK (1U << 1U)            /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO5_0 (coord P12), J28[3]/J43[7]/FXIO_D12
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXIOPANELPINS_RST_PERIPHERAL GPIO                /*!<@brief Peripheral name */
#define BOARD_INITFLEXIOPANELPINS_RST_SIGNAL PIO5                    /*!<@brief Signal name */
#define BOARD_INITFLEXIOPANELPINS_RST_CHANNEL 0                      /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITFLEXIOPANELPINS_RST_GPIO GPIO                      /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITFLEXIOPANELPINS_RST_GPIO_PIN_MASK (1U << 0U)       /*!<@brief GPIO pin mask */
#define BOARD_INITFLEXIOPANELPINS_RST_PORT 5U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFLEXIOPANELPINS_RST_PIN 0U                         /*!<@brief PORT pin number */
#define BOARD_INITFLEXIOPANELPINS_RST_PIN_MASK (1U << 0U)            /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO4_31 (coord N10), J27[1]/J43[8]/FXIO_D11
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXIOPANELPINS_D11_PERIPHERAL GPIO                /*!<@brief Peripheral name */
#define BOARD_INITFLEXIOPANELPINS_D11_SIGNAL PIO4                    /*!<@brief Signal name */
#define BOARD_INITFLEXIOPANELPINS_D11_CHANNEL 31                     /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITFLEXIOPANELPINS_D11_GPIO GPIO                      /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITFLEXIOPANELPINS_D11_GPIO_PIN_MASK (1U << 31U)      /*!<@brief GPIO pin mask */
#define BOARD_INITFLEXIOPANELPINS_D11_PORT 4U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFLEXIOPANELPINS_D11_PIN 31U                        /*!<@brief PORT pin number */
#define BOARD_INITFLEXIOPANELPINS_D11_PIN_MASK (1U << 31U)           /*!<@brief PORT pin mask */
                                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFlexIOPanelPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_EN 0x0100u   /*!<@brief Full drive enable */
#define IOPCTL_PIO_FUNC2 0x02u            /*!<@brief Selects pin function 2 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name FLEXSPI1_SCLK (coord H2), U108[B2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_CLK_PERIPHERAL FLEXSPI1    /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_CLK_SIGNAL FLEXSPI_SCLK    /*!<@brief Signal name */
                                                             /* @} */

/*! @name FLEXSPI1_DATA0 (coord H1), U108[D3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ0_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ0_SIGNAL FLEXSPI_DATA0    /*!<@brief Signal name */
                                                               /* @} */

/*! @name FLEXSPI1_DATA1 (coord G2), U108[D2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ1_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ1_SIGNAL FLEXSPI_DATA1    /*!<@brief Signal name */
                                                               /* @} */

/*! @name FLEXSPI1_DATA2 (coord F1), U108[C4]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ2_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ2_SIGNAL FLEXSPI_DATA2    /*!<@brief Signal name */
                                                               /* @} */

/*! @name FLEXSPI1_DATA3 (coord K3), U108[D4]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ3_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ3_SIGNAL FLEXSPI_DATA3    /*!<@brief Signal name */
                                                               /* @} */

