ukhan717/rt595-mipi/TargetSpecific/Drivers/pin_mux.h
/*! @name FLEXSPI1_DATA4 (coord H5), U108[D5]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ4_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ4_SIGNAL FLEXSPI_DATA4    /*!<@brief Signal name */
                                                               /* @} */

/*! @name FLEXSPI1_DATA5 (coord H4), U108[E3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ5_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ5_SIGNAL FLEXSPI_DATA5    /*!<@brief Signal name */
                                                               /* @} */

/*! @name FLEXSPI1_DATA6 (coord J3), U108[E2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ6_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ6_SIGNAL FLEXSPI_DATA6    /*!<@brief Signal name */
                                                               /* @} */

/*! @name FLEXSPI1_DATA7 (coord J4), U108[E1]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ7_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ7_SIGNAL FLEXSPI_DATA7    /*!<@brief Signal name */
                                                               /* @} */

/*! @name FLEXSPI1_DQS (coord H3), U108[C3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_DQS_PERIPHERAL FLEXSPI1   /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_DQS_SIGNAL FLEXSPI_DQS    /*!<@brief Signal name */
                                                            /* @} */

/*! @name FLEXSPI1_SS0_N (coord E13), U108[A3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_CE_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_CE_SIGNAL FLEXSPI_SS0_N    /*!<@brief Signal name */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPsRamPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO0_12 (coord E14), U44[5]/LCM_BL_PWM_1V8
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITMIPIPANELPINS_LCM_BL_PWM_PERIPHERAL GPIO
/*!
 * @brief Signal name */
#define BOARD_INITMIPIPANELPINS_LCM_BL_PWM_SIGNAL PIO0
/*!
 * @brief Signal channel */
#define BOARD_INITMIPIPANELPINS_LCM_BL_PWM_CHANNEL 12

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITMIPIPANELPINS_LCM_BL_PWM_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITMIPIPANELPINS_LCM_BL_PWM_GPIO_PIN_MASK (1U << 12U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITMIPIPANELPINS_LCM_BL_PWM_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITMIPIPANELPINS_LCM_BL_PWM_PIN 12U
/*!
 * @brief PORT pin mask */
#define BOARD_INITMIPIPANELPINS_LCM_BL_PWM_PIN_MASK (1U << 12U)
/* @} */

/*! @name PIO3_21 (coord E5), J44[21]/LCM_RESET_B
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITMIPIPANELPINS_LCM_RESET_B_PERIPHERAL GPIO
/*!
 * @brief Signal name */
#define BOARD_INITMIPIPANELPINS_LCM_RESET_B_SIGNAL PIO3
/*!
 * @brief Signal channel */
#define BOARD_INITMIPIPANELPINS_LCM_RESET_B_CHANNEL 21

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITMIPIPANELPINS_LCM_RESET_B_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITMIPIPANELPINS_LCM_RESET_B_GPIO_PIN_MASK (1U << 21U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITMIPIPANELPINS_LCM_RESET_B_PORT 3U
/*!
 * @brief PORT pin number */
#define BOARD_INITMIPIPANELPINS_LCM_RESET_B_PIN 21U
/*!
 * @brief PORT pin mask */
#define BOARD_INITMIPIPANELPINS_LCM_RESET_B_PIN_MASK (1U << 21U)
/* @} */

/*! @name PIO3_15 (coord E10), U44[4]/LCM_PWR_EN
  @{ */
/* Routed pin properties */
#define BOARD_INITMIPIPANELPINS_LCM_PWR_EN_PERIPHERAL GPIO           /*!<@brief Peripheral name */
#define BOARD_INITMIPIPANELPINS_LCM_PWR_EN_SIGNAL PIO3               /*!<@brief Signal name */
#define BOARD_INITMIPIPANELPINS_LCM_PWR_EN_CHANNEL 15                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMIPIPANELPINS_LCM_PWR_EN_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMIPIPANELPINS_LCM_PWR_EN_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */
#define BOARD_INITMIPIPANELPINS_LCM_PWR_EN_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITMIPIPANELPINS_LCM_PWR_EN_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITMIPIPANELPINS_LCM_PWR_EN_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                                     /* @} */

