ukhan717/rt595-mipi/TargetSpecific/Drivers/pin_mux.h
/*! @name FC4_RXD_SDA_MOSI_DATA (coord D14), J45[58]/I2C_SDA/U6[6]/ACC_I2C_SDA
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITMIPIPANELPINS_ACC_I2C_SDA_PERIPHERAL FLEXCOMM4
/*!
 * @brief Signal name */
#define BOARD_INITMIPIPANELPINS_ACC_I2C_SDA_SIGNAL RXD_SDA_MOSI_DATA
/* @} */

/*! @name FC4_TXD_SCL_MISO_WS (coord B11), J45[60]/I2C_SCL/U6[4]/ACC_I2C_SCL
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITMIPIPANELPINS_ACC_I2C_SCL_PERIPHERAL FLEXCOMM4
/*!
 * @brief Signal name */
#define BOARD_INITMIPIPANELPINS_ACC_I2C_SCL_SIGNAL TXD_SCL_MISO_WS
/* @} */

/*! @name PIO4_4 (coord P17), U44[3]/LCM_CTP_RST_1V8
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITMIPIPANELPINS_LCM_CTP_RST_B_PERIPHERAL GPIO
/*!
 * @brief Signal name */
#define BOARD_INITMIPIPANELPINS_LCM_CTP_RST_B_SIGNAL PIO4
/*!
 * @brief Signal channel */
#define BOARD_INITMIPIPANELPINS_LCM_CTP_RST_B_CHANNEL 4

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITMIPIPANELPINS_LCM_CTP_RST_B_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITMIPIPANELPINS_LCM_CTP_RST_B_GPIO_PIN_MASK (1U << 4U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITMIPIPANELPINS_LCM_CTP_RST_B_PORT 4U
/*!
 * @brief PORT pin number */
#define BOARD_INITMIPIPANELPINS_LCM_CTP_RST_B_PIN 4U
/*!
 * @brief PORT pin mask */
#define BOARD_INITMIPIPANELPINS_LCM_CTP_RST_B_PIN_MASK (1U << 4U)
/* @} */

/*! @name PIO3_19 (coord C6), U44[6]/LCM_CTP_INT_1V8
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITMIPIPANELPINS_LCM_CTP_INT_PERIPHERAL GPIO
/*!
 * @brief Signal name */
#define BOARD_INITMIPIPANELPINS_LCM_CTP_INT_SIGNAL PIO3
/*!
 * @brief Signal channel */
#define BOARD_INITMIPIPANELPINS_LCM_CTP_INT_CHANNEL 19

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITMIPIPANELPINS_LCM_CTP_INT_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITMIPIPANELPINS_LCM_CTP_INT_GPIO_PIN_MASK (1U << 19U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITMIPIPANELPINS_LCM_CTP_INT_PORT 3U
/*!
 * @brief PORT pin number */
#define BOARD_INITMIPIPANELPINS_LCM_CTP_INT_PIN 19U
/*!
 * @brief PORT pin mask */
#define BOARD_INITMIPIPANELPINS_LCM_CTP_INT_PIN_MASK (1U << 19U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitMipiPanelPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO0_14 (coord B12), Q3[2]/PWM_RED_LED
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LED_RED_PERIPHERAL GPIO           /*!<@brief Peripheral name */
#define BOARD_INITPINS_LED_RED_SIGNAL PIO0               /*!<@brief Signal name */
#define BOARD_INITPINS_LED_RED_CHANNEL 14                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_RED_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_RED_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LED_RED_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_RED_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_RED_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO0_10 (coord K16), USER_KEY2
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_SW2_PERIPHERAL GPIO           /*!<@brief Peripheral name */
#define BOARD_INITPINS_SW2_SIGNAL PIO0               /*!<@brief Signal name */
#define BOARD_INITPINS_SW2_CHANNEL 10                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SW2_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SW2_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_SW2_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SW2_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SW2_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_25 (coord C12), USER_KEY1
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_SW1_PERIPHERAL GPIO           /*!<@brief Peripheral name */
#define BOARD_INITPINS_SW1_SIGNAL PIO0               /*!<@brief Signal name */
#define BOARD_INITPINS_SW1_CHANNEL 25                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SW1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SW1_GPIO_PIN_MASK (1U << 25U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_SW1_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SW1_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SW1_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
